Repository: Krusty84/yaControl
Catalog: yaControl/Resources/Localizable.xcstrings
Source language: en
Languages: kk, ru

# about.author
source: Author: %@
kk: Автор: %@
ru: Автор: %@

# about.contact
source: Contact: %@
kk: Байланыс: %@
ru: Контакт: %@

# about.description
source: This tool helps you manage your Yandex Cloud services from one place. You can start or stop virtual machines, view storage buckets or serverless functions all from one place. It also supports automatic VM start/stop based on macOS conditions, like when your Mac goes to sleep or wakes up.
kk: Бұл құрал Yandex Cloud қызметтерін бір жерден басқаруға көмектеседі. Виртуалды машиналарды іске қосып немесе тоқтатып, сақтау бакеттерін және серверсіз функцияларды бір жерден көре аласыз. Сондай-ақ Mac ұйқы режиміне өткенде немесе оянғанда macOS жағдайларына негізделген ВМ автоматты іске қосу/тоқтатуды қолдайды.
ru: Этот инструмент помогает управлять сервисами Yandex Cloud из одного места. Вы можете запускать и останавливать виртуальные машины, просматривать бакеты хранилища и serverless-функции из одного места. Также поддерживается автоматический запуск и остановка ВМ по событиям macOS, например при переходе Mac в сон или пробуждении.

# about.exit
source: Exit
kk: Шығу
ru: Выход

# about.license
source: License: %@
kk: Лицензия: %@
ru: Лицензия: %@

# common.cancel
source: Cancel
kk: Болдырмау
ru: Отмена

# common.close
source: Close
kk: Жабу
ru: Закрыть

# common.copy
source: Copy
kk: Көшіру
ru: Копировать

# common.createdAt
source: Created At
kk: Жасалған уақыты
ru: Создано

# common.empty
source: Empty
kk: Бос
ru: Пусто

# common.error
source: Error
kk: Қате
ru: Ошибка

# common.folder
source: Folder
kk: Каталог
ru: Каталог

# common.loading
source: Loading...
kk: Жүктелуде...
ru: Загрузка...

# common.name
source: Name
kk: Аты
ru: Имя

# common.open
source: Open
kk: Ашу
ru: Открыть

# common.refresh
source: Refresh
kk: Жаңарту
ru: Обновить

# common.retry
source: Retry
kk: Қайталау
ru: Повторить

# common.status
source: Status
kk: Күйі
ru: Статус

# common.underConstruction
source: Under construction
kk: Әзірленуде
ru: В разработке

# common.updatedAt
source: Updated At
kk: Жаңартылған уақыты
ru: Обновлено

# computing.empty.description
source: Refresh the list or check your Yandex Cloud credentials.
kk: Тізімді жаңартыңыз немесе Yandex Cloud тіркелгі деректерін тексеріңіз.
ru: Обновите список или проверьте учетные данные Yandex Cloud.

# computing.empty.title
source: No VMs Found
kk: ВМ табылмады
ru: Вирт.машины не найдены

# computing.error.title
source: Couldn't Load VMs
kk: ВМ жүктелмеді
ru: Не удалось загрузить ВМ

# computing.loading
source: Loading...
kk: Жүктелуде...
ru: Загрузка...

# computing.refresh
source: Refresh VMs
kk: ВМ жаңарту
ru: Обновить ВМ

# computing.refresh.help
source: Refresh VMs
kk: ВМ тізімін жаңарту
ru: Обновить список ВМ

# computing.runningVMs
source: Running: %lld
kk: Іске қосылған: %lld
ru: Запущено: %lld

# computing.searchPrompt
source: Search VMs
kk: ВМ іздеу
ru: Поиск ВМ

# computing.stopAll
source: Stop All
kk: Барлығын тоқтату
ru: Остановить все

# computing.stopAll.confirmMessage
source: This will stop all currently running virtual machines visible to yaControl.
kk: Бұл yaControl көріп тұрған барлық іске қосылған виртуалды машиналарды тоқтатады.
ru: Это остановит все запущенные виртуальные машины, видимые yaControl.

# computing.stopAll.confirmTitle
source: Stop all running VMs?
kk: Барлық іске қосылған ВМ тоқтатылсын ба?
ru: Остановить все запущенные ВМ?

# computing.stopAll.help
source: Stop all running VMs
kk: Барлық іске қосылған ВМ тоқтату
ru: Остановить все запущенные ВМ

# computing.totalVMs
source: Total VMs: %lld
kk: Барлық ВМ: %lld
ru: Всего ВМ: %lld

# errors.checkConnection
source: Check your internet connection
kk: Интернет қосылымын тексеріңіз
ru: Проверьте подключение к интернету

# errors.checkOAuth
source: Check the validity of the OAuth key (go to application settings)
kk: Қолданба баптауларында OAuth кілтінің дұрыстығын тексеріңіз
ru: Проверьте корректность OAuth-ключа в настройках приложения

# errors.cloudPending
source: Cloud may be pending - refresh data in a few seconds
kk: Cloud күту күйінде болуы мүмкін - деректерді бірнеше секундтан кейін жаңартыңыз
ru: Облако может быть в ожидании - обновите данные через несколько секунд

# errors.errorFormat
source: Error: %@
kk: Қате: %@
ru: Ошибка: %@

# info.activeFunctions
source: Active
kk: Белсенді
ru: Активно

# info.billingInformation
source: Billing Information
kk: Төлем ақпараты
ru: Информация об оплате

# info.currentBalance
source: Current Balance
kk: Ағымдағы баланс
ru: Текущий баланс

# info.details
source: Details
kk: Толығырақ
ru: Подробности

# info.empty.description
source: Refresh statistics or check your Yandex Cloud credentials.
kk: Статистиканы жаңартыңыз немесе Yandex Cloud тіркелгі деректерін тексеріңіз.
ru: Обновите статистику или проверьте учетные данные Yandex Cloud.

# info.empty.title
source: No Resources Found
kk: Ресурстар табылмады
ru: Ресурсы не найдены

# info.error.title
source: Couldn't Load Statistics
kk: Статистика жүктелмеді
ru: Не удалось загрузить статистику

# info.inactiveFunctions
source: Inactive
kk: Белсенді емес
ru: Неактивно

# info.lastUpdated
source: Last updated: %@
kk: Жаңартылды: %@
ru: Обновлено: %@

# info.loading
source: Loading...
kk: Жүктелуде...
ru: Загрузка...

# info.runningVMs
source: Running
kk: Іске қосылған
ru: Запущено

# info.serverlessFunctions
source: Serverless Functions
kk: Серверсіз функциялар
ru: Serverless-функции

# info.stoppedVMs
source: Stopped
kk: Тоқтатылған
ru: Остановлено

# info.storageBuckets
source: Storage Buckets
kk: Сақтау бакеттері
ru: Бакеты хранилища

# info.title
source: Yandex Cloud Statistics
kk: Yandex Cloud статистикасы
ru: Статистика Yandex Cloud

# info.totalBuckets
source: Total Buckets
kk: Барлық бакеттер
ru: Всего бакетов

# info.totalFunctions
source: Total Functions
kk: Барлық функциялар
ru: Всего функций

# info.totalVMs
source: Total VMs
kk: Барлық ВМ
ru: Всего ВМ

# info.viewBilling
source: View Billing
kk: Биллингті көру
ru: Открыть биллинг

# info.virtualMachines
source: Virtual Machines
kk: Виртуалды машиналар
ru: Виртуальные машины

# notification.vm.autoStartFailed
source: VM auto-start failed: %@
kk: ВМ автоматты іске қосылмады: %@
ru: Автозапуск ВМ не удался: %@

# notification.vm.error
source: VM: %@ error: %@. [%@]
kk: ВМ %@ қатесі: %@. [%@]
ru: ВМ %@: ошибка: %@. [%@]

# notification.vm.shutdownCompleted
source: VM shutdown completed.
kk: ВМ тоқтату аяқталды.
ru: Остановка ВМ завершена.

# notification.vm.shutdownFinishedWithErrors
source: VM shutdown finished with errors.
kk: ВМ тоқтату қателермен аяқталды.
ru: Остановка ВМ завершилась с ошибками.

# notification.vm.started
source: VM: %@ has started. [%@]
kk: ВМ %@ іске қосылды. [%@]
ru: ВМ %@ запущена. [%@]

# notification.vm.stopped
source: VM: %@ has stopped. [%@]
kk: ВМ %@ тоқтатылды. [%@]
ru: ВМ %@ остановлена. [%@]

# notification.vm.timeout
source: VM: Timeout: couldn't verify status for %@. [%@]
kk: ВМ: тайм-аут: %@ күйін тексеру мүмкін болмады. [%@]
ru: ВМ: тайм-аут: не удалось проверить статус %@. [%@]

# notification.vm.timeout.id
source: VM: Timeout: couldn't verify status for ID %@. [%@]
kk: ВМ: күту уақыты аяқталды: %@ идентификаторының күйін тексеру мүмкін болмады. [%@]
ru: ВМ: тайм-аут: не удалось проверить статус для ID %@. [%@]

# serverless.activeFunctions
source: Active: %lld
kk: Белсенді: %lld
ru: Активно: %lld

# serverless.empty.description
source: Refresh the list or check your Yandex Cloud credentials.
kk: Тізімді жаңартыңыз немесе Yandex Cloud тіркелгі деректерін тексеріңіз.
ru: Обновите список или проверьте учетные данные Yandex Cloud.

# serverless.empty.title
source: No Serverless Functions Found
kk: Серверсіз функциялар табылмады
ru: Serverless-функции не найдены

# serverless.error.title
source: Couldn't Load Functions
kk: Функциялар жүктелмеді
ru: Не удалось загрузить функции

# serverless.loading
source: Loading...
kk: Жүктелуде...
ru: Загрузка...

# serverless.refresh
source: Refresh Serverless Functions
kk: Серверсіз функцияларды жаңарту
ru: Обновить Serverless-функции

# serverless.refresh.help
source: Refresh Serverless Functions
kk: Серверсіз функциялар тізімін жаңарту
ru: Обновить список Serverless-функций

# serverless.searchPrompt
source: Search Serverless Functions
kk: Серверсіз функцияларды іздеу
ru: Поиск Serverless-функций

# serverless.totalFunctions
source: Total Functions: %lld
kk: Барлық функциялар: %lld
ru: Всего функций: %lld

# settings.applicationPreferences.title
source: Application Preferences
kk: Қолданба баптаулары
ru: Настройки приложения

# settings.appLogging.help
source: Enable or disable application logging
kk: Қолданба журналдарын қосу немесе өшіру
ru: Включить или отключить журналирование приложения

# settings.appLogging.title
source: Application Logging
kk: Қолданба журналдары
ru: Журналирование приложения

# settings.billing.threshold.help
source: Set the minimum balance threshold
kk: Ең төменгі баланс шегін орнату
ru: Задать минимальный порог баланса

# settings.billing.threshold.placeholder
source: The Lower Limit
kk: Төменгі шек
ru: Нижний лимит

# settings.billing.threshold.title
source: Billing Threshold
kk: Баланс шегі
ru: Порог баланса

# settings.debug.apiDebugEnabled
source: Enable API debug mode
kk: API жөндеу режимін қосу
ru: Включить режим отладки API

# settings.debug.apiDebugEnabled.help
source: Show Yandex API requests and responses in the Debug tab.
kk: Yandex API сұраулары мен жауаптарын жөндеу қойындысында көрсету.
ru: Показывать запросы и ответы Yandex API во вкладке отладки.

# settings.debug.clear
source: Clear
kk: Тазарту
ru: Очистить

# settings.debug.messages.title
source: API messages
kk: API хабарламалары
ru: Сообщения API

# settings.debug.saveToFile
source: Save to File
kk: Файлға сақтау
ru: Сохранить в файл

# settings.debug.title
source: API Debug
kk: API жөндеу
ru: Отладка API

# settings.defaultFolder.help
source: Used when creating a new virtual machine, function, or bucket, etc.
kk: Жаңа виртуалды машина, функция немесе бакет жасау кезінде жол таңдалмаған немесе кесте бос болса қолданылады.
ru: Используется при создании новой виртуальной машины, функции, бакета и пр.

# settings.defaultFolder.placeholder
source: Select folder
kk: Каталогты таңдаңыз
ru: Выберите папку

# settings.defaultFolder.reload
source: Reload folders
kk: Каталогтар тізімін жаңарту
ru: Обновить папки

# settings.language.english
source: English
kk: Ағылшын
ru: Английский

# settings.language.help
source: Choose the interface language for this app.
kk: Осы қолданба үшін интерфейс тілін таңдаңыз.
ru: Выберите язык интерфейса для этого приложения.

# settings.language.kazakh
source: Kazakh
kk: Қазақ
ru: Казахский

# settings.language.russian
source: Russian
kk: Орыс
ru: Русский

# settings.language.system
source: System
kk: Жүйелік
ru: Системный

# settings.language.title
source: Interface Language
kk: Интерфейс тілі
ru: Язык интерфейса

# settings.launchAtLogin.help
source: Launch this app automatically when you log in
kk: Жүйеге кіргенде қолданбаны автоматты түрде іске қосу
ru: Автоматически запускать приложение при входе в систему

# settings.notifications.enable
source: Enable Notifications
kk: Хабарландыруларды қосу
ru: Включить уведомления

# settings.notifications.help
source: Request permission for user notifications
kk: Пайдаланушы хабарландыруларына рұқсат сұрау
ru: Запросить разрешение на пользовательские уведомления

# settings.oauth.accessibilityLabel
source: Yandex Cloud OAuth token
kk: Yandex Cloud OAuth токені
ru: OAuth-токен Yandex Cloud

# settings.oauth.emptyError
source: OAuth token is empty.
kk: OAuth токені бос.
ru: OAuth-токен пустой.

# settings.oauth.getKey
source: Get OAuth Key
kk: OAuth кілтін алу
ru: Получить OAuth-ключ

# settings.oauth.help
source: Paste your Yandex Cloud OAuth token, then verify it before saving.
kk: Yandex Cloud OAuth токенін енгізіп, сақтау алдында тексеріңіз.
ru: Вставьте OAuth-токен Yandex Cloud и проверьте его перед сохранением.

# settings.oauth.invalid
source: Invalid credentials
kk: Тіркелгі деректері дұрыс емес
ru: Некорректные учетные данные

# settings.oauth.invalidWithCode
source: Invalid OAuth key (Code %lld)
kk: OAuth кілті дұрыс емес (код %lld)
ru: Некорректный OAuth-ключ (код %lld)

# settings.oauth.placeholder
source: OAuth Key
kk: OAuth кілті
ru: OAuth-ключ

# settings.oauth.required
source: OAuth token is required to verify credentials.
kk: Тіркелгі деректерін тексеру үшін OAuth токені қажет.
ru: Для проверки учетных данных требуется OAuth-токен.

# settings.oauth.title
source: Yandex Cloud Authentication
kk: Yandex Cloud аутентификациясы
ru: Аутентификация Yandex Cloud

# settings.oauth.valid
source: Valid credentials
kk: Тіркелгі деректері дұрыс
ru: Учетные данные корректны

# settings.oauth.verify
source: Verify
kk: Тексеру
ru: Проверить

# settings.oauth.verify.disabledHelp
source: Enter an OAuth token before verification
kk: Тексеру алдында OAuth токенін енгізіңіз
ru: Введите OAuth-токен перед проверкой

# settings.oauth.verify.enabledHelp
source: Verify and save OAuth token
kk: OAuth токенін тексеру және сақтау
ru: Проверить и сохранить OAuth-токен

# settings.tab.billingManagement
source: Billing Management
kk: Төлемдерді басқару
ru: Управление оплатой

# settings.tab.cloud
source: Cloud
kk: Бұлт
ru: Облако

# settings.tab.debug
source: Debug
kk: Жөндеу
ru: Отладка

# settings.tab.general
source: General
kk: Жалпы
ru: Общие

# settings.tab.vmManagement
source: Virtual Machine Management
kk: Виртуалды машиналарды басқару
ru: Управление виртуальными машинами

# settings.vm.autoStartStop.title
source: Auto Start/Stop Mode
kk: Автоматты іске қосу/тоқтату режимі
ru: Режим автоматического запуска/остановки

# settings.vm.enablePowerManagement
source: Enable VM power management
kk: ВМ қуатын басқаруды қосу
ru: Включить управление питанием ВМ

# settings.vm.enablePowerManagement.help
source: Enable or disable automatic VM power management
kk: ВМ қуатын автоматты басқаруды қосу немесе өшіру
ru: Включить или отключить автоматическое управление питанием ВМ

# settings.vm.shutdownMode.title
source: How to shutdown VM
kk: ВМ қалай тоқтатылады
ru: Как останавливать ВМ

# settings.vm.startMode.title
source: How to start VM
kk: ВМ қалай іске қосылады
ru: Как запускать ВМ

# settings.vm.username.help
source: Username for managing your virtual machines
kk: Виртуалды машиналарды басқаруға арналған пайдаланушы аты
ru: Имя пользователя для управления виртуальными машинами

# settings.vm.username.placeholder
source: General VM's Username
kk: ВМ үшін жалпы пайдаланушы аты
ru: Общее имя пользователя ВМ

# settings.vm.username.title
source: General VM's Username
kk: ВМ үшін жалпы пайдаланушы аты
ru: Общее имя пользователя ВМ

# settings.ycCli.get
source: Get Yandex Cloud CLI
kk: Yandex Cloud CLI алу
ru: Получить Yandex Cloud CLI

# settings.ycCli.installed
source: Installed
kk: Орнатылған
ru: Установлен

# settings.ycCli.installed.help
source: Mark whether Yandex Cloud CLI is installed
kk: Yandex Cloud CLI орнатылғанын белгілеу
ru: Отметить, установлен ли Yandex Cloud CLI

# status.currentBalance
source: Current Balance:
kk: Ағымдағы баланс:
ru: Текущий баланс:

# status.lastUpdated
source: Last updated: %@
kk: Жаңартылды: %@
ru: Обновлено: %@

# storage.empty.description
source: Refresh the list or check your Yandex Cloud credentials.
kk: Тізімді жаңартыңыз немесе Yandex Cloud тіркелгі деректерін тексеріңіз.
ru: Обновите список или проверьте учетные данные Yandex Cloud.

# storage.empty.title
source: No Buckets Found
kk: Бакеттер табылмады
ru: Бакеты не найдены

# storage.error.title
source: Couldn't Load Buckets
kk: Бакеттер жүктелмеді
ru: Не удалось загрузить бакеты

# storage.loading
source: Loading...
kk: Жүктелуде...
ru: Загрузка...

# storage.refresh
source: Refresh Buckets
kk: Бакеттерді жаңарту
ru: Обновить бакеты

# storage.refresh.help
source: Refresh Buckets
kk: Бакеттер тізімін жаңарту
ru: Обновить список бакетов

# storage.searchPrompt
source: Search buckets
kk: Бакеттерді іздеу
ru: Поиск бакетов

# storage.totalBuckets
source: Total Buckets: %lld
kk: Барлық бакеттер: %lld
ru: Всего бакетов: %lld

# table.action.autoPowerManagement
source: Auto power management
kk: Қуатты автоматты басқару
ru: Автоматическое управление питанием

# table.action.copyInvokeURL
source: Copy invoke URL
kk: Шақыру URL-ін көшіру
ru: Копировать URL вызова

# table.action.copyIPs
source: Copy IPs
kk: IP-лерді көшіру
ru: Копировать IP

# table.action.copyNameAndID
source: Copy name & ID
kk: Атауы мен ID көшіру
ru: Копировать имя и ID

# table.action.copyYCCommand
source: Copy YC Command
kk: YC командасын көшіру
ru: Копировать YC команду

# table.action.createBucket
source: Create bucket
kk: Бакет жасау
ru: Создать бакет

# table.action.createFunction
source: Create function
kk: Функция жасау
ru: Создать функцию

# table.action.createVM
source: Create virtual machine
kk: Виртуалды машина жасау
ru: Создать виртуальную машину

# table.action.goToSettingsSetUsername
source: Go to settings to set username
kk: Пайдаланушы атын орнату үшін баптауларға өтіңіз
ru: Перейдите в настройки, чтобы указать имя пользователя

# table.action.openRDP
source: Open RDP
kk: RDP ашу
ru: Открыть RDP

# table.action.openSSH
source: Open SSH
kk: SSH ашу
ru: Открыть SSH

# table.serverless.createdAt
source: Created At
kk: Жасалған уақыты
ru: Создано

# table.serverless.folder
source: Folder
kk: Каталог
ru: Каталог

# table.serverless.invoke
source: Invoke
kk: Шақыру
ru: Вызов

# table.serverless.name
source: Name
kk: Аты
ru: Имя

# table.serverless.status
source: Status
kk: Күйі
ru: Статус

# table.storage.createdAt
source: Created At
kk: Жасалған уақыты
ru: Создано

# table.storage.files
source: Files
kk: Файлдар
ru: Файлы

# table.storage.folder
source: Folder
kk: Каталог
ru: Каталог

# table.storage.maxSizeGB
source: Max Size (Gb)
kk: Макс. өлшем (Гб)
ru: Макс. размер (Гб)

# table.storage.name
source: Name
kk: Аты
ru: Имя

# table.storage.updatedAt
source: Updated At
kk: Жаңартылған уақыты
ru: Обновлено

# table.storage.usedSizeGB
source: Used Size (Gb)
kk: Пайдаланылған өлшем (Гб)
ru: Использовано (Гб)

# table.vm.autoStart
source: AS
kk: АҚ
ru: АП

# table.vm.cores
source: Cores
kk: Ядролар
ru: Ядра

# table.vm.createdAt
source: Created At
kk: Жасалған уақыты
ru: Создано

# table.vm.folder
source: Folder
kk: Каталог
ru: Каталог

# table.vm.name
source: Name
kk: Аты
ru: Имя

# table.vm.publicIP
source: Public IP
kk: Жария IP
ru: Публичный IP

# table.vm.ram
source: RAM
kk: Жедел жад
ru: ОЗУ

# table.vm.status
source: Status
kk: Күйі
ru: Статус

# tabs.about
source: About
kk: Қолданба туралы
ru: О приложении

# tabs.computing
source: Computing
kk: Есептеу
ru: Вирт.машины

# tabs.functions
source: Functions
kk: Функциялар
ru: Функции

# tabs.settings
source: Settings
kk: Баптаулар
ru: Настройки

# tabs.storage
source: Storage
kk: Сақтау қоймасы
ru: Хранилище

# vmAutomation.shutdown.afterAppExit
source: After app exit
kk: Қолданбадан шыққаннан кейін
ru: После выхода из приложения

# vmAutomation.shutdown.afterMacOSShutdown
source: After macOS shutdown
kk: macOS өшірілген кезде
ru: При завершении работы macOS

# vmAutomation.shutdown.afterMacOSSleep
source: After macOS sleep
kk: macOS ұйқы режиміне өткенде
ru: При переходе macOS в сон

# vmAutomation.start.afterAppLaunched
source: After app launched
kk: Қолданба іске қосылғаннан кейін
ru: После запуска приложения

# vmAutomation.start.afterMacOSStarted
source: After macOS started
kk: macOS іске қосылғаннан кейін
ru: После запуска macOS

# vmAutomation.start.afterWakeup
source: After wakeup
kk: Ұйқы режимінен шыққаннан кейін
ru: После выхода из сна

# settings.defaultFolder.title
source: Default folder for create a new resources
ru: Папка по умолчанию для новых ресурсов
